In [25]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.impute import SimpleImputer
from sklearn.decomposition import TruncatedSVD
from sklearn.preprocessing import StandardScaler
from xgboost import XGBClassifier
from sklearn.pipeline import Pipeline
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report

In [2]:
df = pd.read_csv('air_system_previous_years.csv')

In [3]:
df2= pd.read_csv('air_system_present_year.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60000 entries, 0 to 59999
Columns: 171 entries, class to eg_000
dtypes: int64(1), object(170)
memory usage: 78.3+ MB

In [5]:
print(df)

      class  aa_000 ab_000      ac_000 ad_000 ae_000 af_000 ag_000 ag_001  \
0       neg   76698     na  2130706438    280      0      0      0      0
1       neg   33058     na           0     na      0      0      0      0
2       neg   41040     na         228    100      0      0      0      0
3       neg      12      0          70     66      0     10      0      0
4       neg   60874     na        1368    458      0      0      0      0
...     ...     ...    ...         ...    ...    ...    ...    ...    ...
59995   neg  153002     na         664    186      0      0      0      0
59996   neg    2286     na  2130706538    224      0      0      0      0
59997   neg     112      0  2130706432     18      0      0      0      0
59998   neg   80292     na  2130706432    494      0      0      0      0
59999   neg   40222     na         698    628      0      0      0      0

      ag_002  ...   ee_002  ee_003   ee_004   ee_005   ee_006  ee_007  ee_008  \
0          0  ...  1240520  493384   721044   469792   339156  157956   73224
1          0  ...   421400  178064   293306   245416   133654   81140   97576
2          0  ...   277378  159812   423992   409564   320746  158022   95128
3          0  ...      240      46       58       44       10       0       0
4          0  ...   622012  229790   405298   347188   286954  311560  433954
...      ...  ...      ...     ...      ...      ...      ...     ...     ...
59995      0  ...   998500  566884  1290398  1218244  1019768  717762  898642
59996      0  ...    10578    6760    21126    68424      136       0       0
59997      0  ...      792     386      452      144      146    2622       0
59998      0  ...   699352  222654   347378   225724   194440  165070  802280
59999      0  ...   440066  183200   344546   254068   225148  158304  170384

       ee_009 ef_000 eg_000
0           0      0      0
1        1500      0      0
2         514      0      0
3           0      4     32
4        1218      0      0
...       ...    ...    ...
59995   28588      0      0
59996       0      0      0
59997       0      0      0
59998  388422      0      0
59999     158      0      0

[60000 rows x 171 columns]

In [13]:
df['class'].value_counts()

class
neg    59000
pos     1000
Name: count, dtype: int64

In [12]:
# Display basic DataFrame information
print("Info for df (air_system_previous_years.csv):")
df.info()

print("\nInfo for df2 (air_system_present_year.csv):")
df2.info()

# Print more detailed information for each column
print("\nDetailed column information for df:")
for column in df.columns:
    print(f"Column '{column}':")
    print(df[column].describe())
    print()

print("\nDetailed column information for df2:")
for column in df2.columns:
    print(f"Column '{column}':")
    print(df2[column].describe())
    print()

Info for df (air_system_previous_years.csv):
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60000 entries, 0 to 59999
Columns: 171 entries, class to eg_000
dtypes: int64(1), object(170)
memory usage: 78.3+ MB

Info for df2 (air_system_present_year.csv):
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16000 entries, 0 to 15999
Columns: 171 entries, class to eg_000
dtypes: int64(1), object(170)
memory usage: 20.9+ MB

Detailed column information for df:
Column 'class':
count     60000
unique        2
top         neg
freq      59000
Name: class, dtype: object

Column 'aa_000':
count    6.000000e+04
mean     5.933650e+04
std      1.454301e+05
min      0.000000e+00
25%      8.340000e+02
50%      3.077600e+04
75%      4.866800e+04
max      2.746564e+06
Name: aa_000, dtype: float64

Column 'ab_000':
count     60000
unique       30
top          na
freq      46329
Name: ab_000, dtype: object

Column 'ac_000':
count     60000
unique     2062
top           0
freq       8752
Name: ac_000, dtype: object

Column 'ad_000':
count     60000
unique     1887
top          na
freq      14861
Name: ad_000, dtype: object

Column 'ae_000':
count     60000
unique      334
top           0
freq      55543
Name: ae_000, dtype: object

Column 'af_000':
count     60000
unique      419
top           0
freq      55476
Name: af_000, dtype: object

Column 'ag_000':
count     60000
unique      155
top           0
freq      59133
Name: ag_000, dtype: object

Column 'ag_001':
count     60000
unique      618
top           0
freq      58587
Name: ag_001, dtype: object

Column 'ag_002':
count     60000
unique     2423
top           0
freq      56181
Name: ag_002, dtype: object

Column 'ag_003':
count     60000
unique     7880
top           0
freq      46894
Name: ag_003, dtype: object

Column 'ag_004':
count     60000
unique    23072
top           0
freq       1305
Name: ag_004, dtype: object

Column 'ag_005':
count     60000
unique    40798
top           0
freq       1941
Name: ag_005, dtype: object

Column 'ag_006':
count     60000
unique    40616
top           0
freq       1238
Name: ag_006, dtype: object

Column 'ag_007':
count     60000
unique    32126
top           0
freq      15875
Name: ag_007, dtype: object

Column 'ag_008':
count     60000
unique    18933
top           0
freq      25091
Name: ag_008, dtype: object

Column 'ag_009':
count     60000
unique     5356
top           0
freq      40698
Name: ag_009, dtype: object

Column 'ah_000':
count     60000
unique    43572
top          na
freq        645
Name: ah_000, dtype: object

Column 'ai_000':
count     60000
unique     4056
top           0
freq      53588
Name: ai_000, dtype: object

Column 'aj_000':
count     60000
unique      895
top           0
freq      46919
Name: aj_000, dtype: object

Column 'ak_000':
count     60000
unique      160
top           0
freq      55227
Name: ak_000, dtype: object

Column 'al_000':
count     60000
unique     9018
top           0
freq      37473
Name: al_000, dtype: object

Column 'am_0':
count     60000
unique    10583
top           0
freq      37295
Name: am_0, dtype: object

Column 'an_000':
count     60000
unique    48205
top          na
freq        642
Name: an_000, dtype: object

Column 'ao_000':
count     60000
unique    47724
top          na
freq        589
Name: ao_000, dtype: object

Column 'ap_000':
count     60000
unique    44673
top          na
freq        642
Name: ap_000, dtype: object

Column 'aq_000':
count     60000
unique    34922
top          na
freq        589
Name: aq_000, dtype: object

Column 'ar_000':
count     60000
unique       69
top           0
freq      54928
Name: ar_000, dtype: object

Column 'as_000':
count     60000
unique       22
top           0
freq      59350
Name: as_000, dtype: object

Column 'at_000':
count     60000
unique     3512
top           0
freq      53395
Name: at_000, dtype: object

Column 'au_000':
count     60000
unique       57
top           0
freq      59310
Name: au_000, dtype: object

Column 'av_000':
count     60000
unique     3861
top           0
freq      10008
Name: av_000, dtype: object

Column 'ax_000':
count     60000
unique     2216
top           0
freq      10191
Name: ax_000, dtype: object

Column 'ay_000':
count     60000
unique      467
top           0
freq      58761
Name: ay_000, dtype: object

Column 'ay_001':
count     60000
unique      920
top           0
freq      58192
Name: ay_001, dtype: object

Column 'ay_002':
count     60000
unique      987
top           0
freq      58162
Name: ay_002, dtype: object

Column 'ay_003':
count     60000
unique     1033
top           0
freq      58078
Name: ay_003, dtype: object

Column 'ay_004':
count     60000
unique     1768
top           0
freq      57158
Name: ay_004, dtype: object

Column 'ay_005':
count     60000
unique    19697
top           0
freq      30338
Name: ay_005, dtype: object

Column 'ay_006':
count     60000
unique    34629
top           0
freq      16604
Name: ay_006, dtype: object

Column 'ay_007':
count     60000
unique    38652
top           0
freq       7432
Name: ay_007, dtype: object

Column 'ay_008':
count     60000
unique    37823
top           0
freq       4944
Name: ay_008, dtype: object

Column 'ay_009':
count     60000
unique      448
top           0
freq      58789
Name: ay_009, dtype: object

Column 'az_000':
count     60000
unique     9185
top           0
freq       1096
Name: az_000, dtype: object

Column 'az_001':
count     60000
unique     7379
top           0
freq       1458
Name: az_001, dtype: object

Column 'az_002':
count     60000
unique     9065
top           0
freq       1280
Name: az_002, dtype: object

Column 'az_003':
count     60000
unique    21531
top           0
freq       1184
Name: az_003, dtype: object

Column 'az_004':
count     60000
unique    34078
top           0
freq       1147
Name: az_004, dtype: object

Column 'az_005':
count     60000
unique    44602
top           0
freq       1129
Name: az_005, dtype: object

Column 'az_006':
count     60000
unique    12307
top           0
freq       8672
Name: az_006, dtype: object

Column 'az_007':
count     60000
unique     3877
top           0
freq      45094
Name: az_007, dtype: object

Column 'az_008':
count     60000
unique     1272
top           0
freq      54222
Name: az_008, dtype: object

Column 'az_009':
count     60000
unique      337
top           0
freq      57445
Name: az_009, dtype: object

Column 'ba_000':
count     60000
unique    44841
top           0
freq       1089
Name: ba_000, dtype: object

Column 'ba_001':
count     60000
unique    40165
top           0
freq       1139
Name: ba_001, dtype: object

Column 'ba_002':
count     60000
unique    35959
top           0
freq       1172
Name: ba_002, dtype: object

Column 'ba_003':
count     60000
unique    32915
top           0
freq       1204
Name: ba_003, dtype: object

Column 'ba_004':
count     60000
unique    30674
top           0
freq       1236
Name: ba_004, dtype: object

Column 'ba_005':
count     60000
unique    29594
top           0
freq       1328
Name: ba_005, dtype: object

Column 'ba_006':
count     60000
unique    29282
top           0
freq       1997
Name: ba_006, dtype: object

Column 'ba_007':
count     60000
unique    25167
top           0
freq       8038
Name: ba_007, dtype: object

Column 'ba_008':
count     60000
unique    11817
top           0
freq      24854
Name: ba_008, dtype: object

Column 'ba_009':
count     60000
unique     6798
top           0
freq      39619
Name: ba_009, dtype: object

Column 'bb_000':
count     60000
unique    49393
top          na
freq        645
Name: bb_000, dtype: object

Column 'bc_000':
count     60000
unique     2808
top           0
freq      19296
Name: bc_000, dtype: object

Column 'bd_000':
count     60000
unique     3566
top           0
freq       4030
Name: bd_000, dtype: object

Column 'be_000':
count     60000
unique     3919
top           0
freq       6951
Name: be_000, dtype: object

Column 'bf_000':
count     60000
unique     1099
top           0
freq      25294
Name: bf_000, dtype: object

Column 'bg_000':
count     60000
unique    43569
top          na
freq        642
Name: bg_000, dtype: object

Column 'bh_000':
count     60000
unique    25241
top          na
freq        642
Name: bh_000, dtype: object

Column 'bi_000':
count     60000
unique    42099
top          na
freq        589
Name: bi_000, dtype: object

Column 'bj_000':
count     60000
unique    38360
top          na
freq        589
Name: bj_000, dtype: object

Column 'bk_000':
count     60000
unique    12918
top          na
freq      23034
Name: bk_000, dtype: object

Column 'bl_000':
count     60000
unique    11970
top          na
freq      27277
Name: bl_000, dtype: object

Column 'bm_000':
count     60000
unique     9038
top          na
freq      39549
Name: bm_000, dtype: object

Column 'bn_000':
count     60000
unique     7097
top          na
freq      44009
Name: bn_000, dtype: object

Column 'bo_000':
count     60000
unique     5839
top          na
freq      46333
Name: bo_000, dtype: object

Column 'bp_000':
count     60000
unique     4969
top          na
freq      47740
Name: bp_000, dtype: object

Column 'bq_000':
count     60000
unique     4277
top          na
freq      48722
Name: bq_000, dtype: object

Column 'br_000':
count     60000
unique     3807
top          na
freq      49264
Name: br_000, dtype: object

Column 'bs_000':
count     60000
unique    12835
top          na
freq        726
Name: bs_000, dtype: object

Column 'bt_000':
count     60000
unique    45481
top          na
freq        167
Name: bt_000, dtype: object

Column 'bu_000':
count     60000
unique    49350
top          na
freq        691
Name: bu_000, dtype: object

Column 'bv_000':
count     60000
unique    49347
top          na
freq        691
Name: bv_000, dtype: object

Column 'bx_000':
count     60000
unique    52849
top          na
freq       3257
Name: bx_000, dtype: object

Column 'by_000':
count     60000
unique    22628
top           0
freq       1224
Name: by_000, dtype: object

Column 'bz_000':
count     60000
unique    16548
top           0
freq      13841
Name: bz_000, dtype: object

Column 'ca_000':
count     60000
unique    28319
top          na
freq       4356
Name: ca_000, dtype: object

Column 'cb_000':
count     60000
unique    30171
top          na
freq        726
Name: cb_000, dtype: object

Column 'cc_000':
count     60000
unique    43860
top          na
freq       3255
Name: cc_000, dtype: object

Column 'cd_000':
count       60000
unique          2
top       1209600
freq        59324
Name: cd_000, dtype: object

Column 'ce_000':
count     60000
unique    22076
top           0
freq      11845
Name: ce_000, dtype: object

Column 'cf_000':
count     60000
unique      526
top           0
freq      21468
Name: cf_000, dtype: object

Column 'cg_000':
count     60000
unique      647
top          na
freq      14861
Name: cg_000, dtype: object

Column 'ch_000':
count     60000
unique        3
top           0
freq      45129
Name: ch_000, dtype: object

Column 'ci_000':
count     60000
unique    45965
top          na
freq        338
Name: ci_000, dtype: object

Column 'cj_000':
count     60000
unique     7618
top           0
freq      47122
Name: cj_000, dtype: object

Column 'ck_000':
count     60000
unique    45044
top          na
freq        338
Name: ck_000, dtype: object

Column 'cl_000':
count     60000
unique      973
top           0
freq      36787
Name: cl_000, dtype: object

Column 'cm_000':
count     60000
unique     2124
top           0
freq      24215
Name: cm_000, dtype: object

Column 'cn_000':
count     60000
unique     1531
top           0
freq      57300
Name: cn_000, dtype: object

Column 'cn_001':
count     60000
unique     5420
top           0
freq      50464
Name: cn_001, dtype: object

Column 'cn_002':
count     60000
unique    14790
top           0
freq      30538
Name: cn_002, dtype: object

Column 'cn_003':
count     60000
unique    34111
top           0
freq       2594
Name: cn_003, dtype: object

Column 'cn_004':
count     60000
unique    42087
top           0
freq       1107
Name: cn_004, dtype: object

Column 'cn_005':
count     60000
unique    38555
top           0
freq       1175
Name: cn_005, dtype: object

Column 'cn_006':
count     60000
unique    32427
top           0
freq       2726
Name: cn_006, dtype: object

Column 'cn_007':
count     60000
unique    21997
top           0
freq       9289
Name: cn_007, dtype: object

Column 'cn_008':
count     60000
unique    10118
top           0
freq      15387
Name: cn_008, dtype: object

Column 'cn_009':
count     60000
unique     3056
top           0
freq      25978
Name: cn_009, dtype: object

Column 'co_000':
count     60000
unique     1861
top          na
freq      14861
Name: co_000, dtype: object

Column 'cp_000':
count     60000
unique     2316
top           0
freq       9537
Name: cp_000, dtype: object

Column 'cq_000':
count     60000
unique    49348
top          na
freq        691
Name: cq_000, dtype: object

Column 'cr_000':
count     60000
unique       75
top          na
freq      46329
Name: cr_000, dtype: object

Column 'cs_000':
count     60000
unique     9298
top           0
freq       1090
Name: cs_000, dtype: object

Column 'cs_001':
count     60000
unique     3344
top           0
freq       1255
Name: cs_001, dtype: object

Column 'cs_002':
count     60000
unique    28278
top           0
freq       1168
Name: cs_002, dtype: object

Column 'cs_003':
count     60000
unique    35194
top           0
freq       1205
Name: cs_003, dtype: object

Column 'cs_004':
count     60000
unique    34559
top           0
freq       1223
Name: cs_004, dtype: object

Column 'cs_005':
count     60000
unique    42559
top           0
freq       1130
Name: cs_005, dtype: object

Column 'cs_006':
count     60000
unique    40917
top           0
freq       1122
Name: cs_006, dtype: object

Column 'cs_007':
count     60000
unique    17301
top           0
freq       5107
Name: cs_007, dtype: object

Column 'cs_008':
count     60000
unique      774
top           0
freq      14043
Name: cs_008, dtype: object

Column 'cs_009':
count     60000
unique       54
top           0
freq      56427
Name: cs_009, dtype: object

Column 'ct_000':
count     60000
unique     2618
top          na
freq      13808
Name: ct_000, dtype: object

Column 'cu_000':
count     60000
unique     3520
top          na
freq      13808
Name: cu_000, dtype: object

Column 'cv_000':
count     60000
unique    32929
top          na
freq      13808
Name: cv_000, dtype: object

Column 'cx_000':
count     60000
unique    25237
top          na
freq      13808
Name: cx_000, dtype: object

Column 'cy_000':
count     60000
unique      749
top           0
freq      39509
Name: cy_000, dtype: object

Column 'cz_000':
count     60000
unique    10728
top          na
freq      13808
Name: cz_000, dtype: object

Column 'da_000':
count     60000
unique      264
top           0
freq      45645
Name: da_000, dtype: object

Column 'db_000':
count     60000
unique      147
top           0
freq      27715
Name: db_000, dtype: object

Column 'dc_000':
count     60000
unique    33178
top          na
freq      13808
Name: dc_000, dtype: object

Column 'dd_000':
count     60000
unique     6564
top          na
freq       2503
Name: dd_000, dtype: object

Column 'de_000':
count     60000
unique     1894
top          na
freq       2724
Name: de_000, dtype: object

Column 'df_000':
count     60000
unique      403
top           0
freq      54930
Name: df_000, dtype: object

Column 'dg_000':
count     60000
unique     1314
top           0
freq      54424
Name: dg_000, dtype: object

Column 'dh_000':
count     60000
unique     1056
top           0
freq      49008
Name: dh_000, dtype: object

Column 'di_000':
count     60000
unique     5619
top           0
freq      45647
Name: di_000, dtype: object

Column 'dj_000':
count     60000
unique       73
top           0
freq      55796
Name: dj_000, dtype: object

Column 'dk_000':
count     60000
unique      257
top           0
freq      55675
Name: dk_000, dtype: object

Column 'dl_000':
count     60000
unique      182
top           0
freq      55769
Name: dl_000, dtype: object

Column 'dm_000':
count     60000
unique      222
top           0
freq      55734
Name: dm_000, dtype: object

Column 'dn_000':
count     60000
unique    21099
top          na
freq        691
Name: dn_000, dtype: object

Column 'do_000':
count     60000
unique    20515
top           0
freq      13287
Name: do_000, dtype: object

Column 'dp_000':
count     60000
unique    11569
top           0
freq      12750
Name: dp_000, dtype: object

Column 'dq_000':
count     60000
unique     8111
top           0
freq      44404
Name: dq_000, dtype: object

Column 'dr_000':
count     60000
unique     6683
top           0
freq      44267
Name: dr_000, dtype: object

Column 'ds_000':
count     60000
unique    26313
top          na
freq       2727
Name: ds_000, dtype: object

Column 'dt_000':
count     60000
unique    15911
top          na
freq       2727
Name: dt_000, dtype: object

Column 'du_000':
count     60000
unique    28496
top           0
freq       3280
Name: du_000, dtype: object

Column 'dv_000':
count     60000
unique    30140
top           0
freq       3278
Name: dv_000, dtype: object

Column 'dx_000':
count     60000
unique    14736
top           0
freq      39558
Name: dx_000, dtype: object

Column 'dy_000':
count     60000
unique     6312
top           0
freq      36269
Name: dy_000, dtype: object

Column 'dz_000':
count     60000
unique       48
top           0
freq      56984
Name: dz_000, dtype: object

Column 'ea_000':
count     60000
unique      135
top           0
freq      56535
Name: ea_000, dtype: object

Column 'eb_000':
count     60000
unique    27832
top           0
freq      21449
Name: eb_000, dtype: object

Column 'ec_00':
count     60000
unique    31142
top          na
freq      10239
Name: ec_00, dtype: object

Column 'ed_000':
count     60000
unique     3931
top          na
freq       9553
Name: ed_000, dtype: object

Column 'ee_000':
count     60000
unique    41816
top           0
freq       1089
Name: ee_000, dtype: object

Column 'ee_001':
count     60000
unique    38246
top           0
freq       1157
Name: ee_001, dtype: object

Column 'ee_002':
count     60000
unique    34489
top           0
freq       1364
Name: ee_002, dtype: object

Column 'ee_003':
count     60000
unique    31712
top           0
freq       1557
Name: ee_003, dtype: object

Column 'ee_004':
count     60000
unique    35189
top           0
freq       1797
Name: ee_004, dtype: object

Column 'ee_005':
count     60000
unique    36289
top           0
freq       2814
Name: ee_005, dtype: object

Column 'ee_006':
count     60000
unique    31796
top           0
freq       4458
Name: ee_006, dtype: object

Column 'ee_007':
count     60000
unique    30470
top           0
freq       7898
Name: ee_007, dtype: object

Column 'ee_008':
count     60000
unique    24214
top           0
freq      17280
Name: ee_008, dtype: object

Column 'ee_009':
count     60000
unique     9725
top           0
freq      31863
Name: ee_009, dtype: object

Column 'ef_000':
count     60000
unique       29
top           0
freq      57021
Name: ef_000, dtype: object

Column 'eg_000':
count     60000
unique       50
top           0
freq      56794
Name: eg_000, dtype: object


Detailed column information for df2:
Column 'class':
count     16000
unique        2
top         neg
freq      15625
Name: class, dtype: object

Column 'aa_000':
count    1.600000e+04
mean     6.799698e+04
std      5.035350e+05
min      0.000000e+00
25%      9.280000e+02
50%      3.098200e+04
75%      4.947900e+04
max      4.294967e+07
Name: aa_000, dtype: float64

Column 'ab_000':
count     16000
unique       19
top          na
freq      12363
Name: ab_000, dtype: object

Column 'ac_000':
count     16000
unique     1312
top           0
freq       2289
Name: ac_000, dtype: object

Column 'ad_000':

In [16]:
# Replace 'na' with NaN
df.replace('na', np.nan, inplace=True)
df2.replace('na', np.nan, inplace=True)

# Identify the columns to be converted to float
columns_to_convert = df.columns.difference(['class'])

# Convert the columns to float
df[columns_to_convert] = df[columns_to_convert].astype(float)
df2[columns_to_convert] = df2[columns_to_convert].astype(float)

In [19]:
# Calculate the Pearson correlation matrix
cor_matr = df[columns_to_convert].corr(method='pearson')

# Find columns with high correlation >= 0.80 or <= -0.80
high_corr_pairs = []
low_corr_columns = set(columns_to_convert)

# Iterate over the correlation matrix to find pairs
for i in range(len(cor_matr.columns)):
    for j in range(i):
        if abs(cor_matr.iloc[i, j]) >= 0.80:
            colname1 = cor_matr.columns[i]
            colname2 = cor_matr.columns[j]
            high_corr_pairs.append((colname1, colname2, cor_matr.iloc[i, j]))
            low_corr_columns.discard(colname1)
            low_corr_columns.discard(colname2)

# Display the high correlation pairs
high_corr_pairs_df = pd.DataFrame(high_corr_pairs, columns=['Column1', 'Column2', 'Correlation'])
print("High Correlation Pairs:")
print(high_corr_pairs_df)

# Display the low correlation columns
low_corr_columns = list(low_corr_columns)
print("Low Correlation Columns:")
print(low_corr_columns)

High Correlation Pairs:
    Column1 Column2  Correlation
0    af_000  ae_000     0.823108
1    ag_004  ag_003     0.873726
2    ag_007  ag_006     0.856696
3    ah_000  aa_000     0.908103
4    ak_000  aj_000     0.930056
..      ...     ...          ...
411  ee_004  by_000     0.815882
412  ee_004  cn_004     0.877116
413  ee_004  cs_005     0.863802
414  ee_004  ee_002     0.885433
415  ee_004  ee_003     0.955882

[416 rows x 3 columns]
Low Correlation Columns:
['dy_000', 'dh_000', 'cs_008', 'ac_000', 'ef_000', 'ay_001', 'dj_000', 'dk_000', 'dd_000', 'az_002', 'ag_000', 'ee_008', 'cy_000', 'ax_000', 'bc_000', 'df_000', 'ee_005', 'ar_000', 'dg_000', 'cn_009', 'cn_008', 'ea_000', 'bz_000', 'cs_006', 'at_000', 'ch_000', 'ee_009', 'ct_000', 'ay_004', 'ag_001', 'cn_000', 'az_001', 'cs_009', 'cs_007', 'di_000', 'bs_000', 'as_000', 'cs_004', 'az_008', 'be_000', 'dq_000', 'cg_000', 'az_004', 'cl_000', 'au_000', 'cs_001', 'ee_006', 'eb_000', 'az_007', 'az_009', 'az_006', 'cj_000', 'de_000', 'ba_009', 'ba_008', 'bd_000', 'ay_000', 'ab_000', 'eg_000', 'ba_007', 'ag_008', 'ai_000', 'ay_008', 'az_000', 'bf_000', 'ay_005', 'dx_000', 'ay_006', 'da_000', 'ag_009', 'dr_000', 'cn_007', 'db_000', 'ay_009', 'cr_000', 'cm_000', 'az_003', 'av_000', 'dz_000', 'cd_000', 'ce_000', 'ee_007', 'cp_000']

In [20]:
len(low_corr_columns)
low_corr_columns_df = pd.DataFrame(low_corr_columns, columns=['LowCorrelationColumns'])

In [21]:
len(low_corr_columns)

83

In [31]:
# Prepare data for modeling
X = df[low_corr_columns]
y = df['class'].apply(lambda x: 1 if x == 'pos' else 0)  # Encode 'class' as 1 for 'pos' and 0 for 'neg'

# Split the data into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Create a pipeline
pipeline = Pipeline([
    ('imputer', SimpleImputer(strategy='mean')),
    ('scaler', StandardScaler()),
    ('svd', TruncatedSVD(n_components=20)),  # Increase number of components
    ('xgb', XGBClassifier(use_label_encoder=False, eval_metric='logloss', n_estimators=200))
])

# Train the model
pipeline.fit(X_train, y_train)

# Make predictions
y_pred = pipeline.predict(X_test)

# Evaluate the model
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.99      1.00      0.99     11788
           1       0.75      0.60      0.67       212

    accuracy                           0.99     12000
   macro avg       0.87      0.80      0.83     12000
weighted avg       0.99      0.99      0.99     12000

In [32]:
# Use the model to make predictions on the present year data
X_present = df2[low_corr_columns]

# Apply the same preprocessing and transformation steps
X_present_imputed = pipeline.named_steps['imputer'].transform(X_present)
X_present_scaled = pipeline.named_steps['scaler'].transform(X_present_imputed)
X_present_svd = pipeline.named_steps['svd'].transform(X_present_scaled)

# Make predictions on the processed present year data
y_present_pred = pipeline.named_steps['xgb'].predict(X_present_svd)

# Add predictions to the present year data
df2['predicted_class'] = y_present_pred

In [33]:
df2['predicted_class'].value_counts()

predicted_class
0    15729
1      271
Name: count, dtype: int64